Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/tm/cuspy-level1.tmx
Source language: en_gb
Languages: fr_fr

source: In the previous section, we have seen that the parameters :math:`\gamma` and :math:`\mu` are mostly noninfluential.
fr_fr: Dans la section antérieure on a vu que les paramètres :math:`\gamma` et :math:`\mu` n'ont presque pas d'influence sur les résultats de la simulation.

source: In this case, since we suppose we do not have any additional information.
fr_fr: Dans ce cas, on présume qu'on n'a pas d'information additionnelle.

source: In this case, the model OKP is run using the instruction ``run_okp`` of the :mod:`okplm` package.
fr_fr: Dans ce cas, le modèle OKP est exécuté avec la commande ``run_okp`` du paquet :mod:`okplm`.

source: In this case, the output files follow the pattern "mc_pavg_<vpa>_by_<v>.txt".
fr_fr: Dans ce cas, les fichiers de sortie suivent le modèle "mc_pavg_<vpa>_by_<v>.txt".

source: In this case, the sum of all :math:`S_i` is 0.7.
fr_fr: Dans notre cas, la somme de tous les :math:`S_i` est 0.7.

source: In this example, we will apply this model to the case of surface temperature in the reservoir of Naussac.
fr_fr: Dans cet exemple, nous appliquons ce modèle au cas de la température de la surface dans la retenue de Naussac.

source: In this type of models we often find a lack of identifiability, since the complexity of the model is usually greater than the available information about the behaviour of the system.
fr_fr: En ce type de modèles on trouve souvent un manque d'identifiabilité, puisque la complexité du modèle est d'habitude plus importante que l'information disponible sur le comportement du système.

source: Indices and tables
fr_fr: Indices et tableaux

source: Infinite combinations of values for :math:`\alpha` and :math:`\beta` give the same result.
fr_fr: Infinies combinaisons de valeurs pour :math:`\alpha` et :math:`\beta` donnent le même résultat.

source: Information on prior parameter uncertainty can be provided to PEST++ through an uncertainty file using the PEST++ control variable ``parcov``.
fr_fr: On peut passer de l'information à PEST++ sur l'incertitude a priori des paramètres par le moyen d'un fichier d'incertitude avec la variable de contrôle de PEST++ ``parcov``.

source: Installing :mod:`cuspy`
fr_fr: Installation de :mod:`cuspy`

source: Instead of an optimum there are several optima with similar performance.
fr_fr: Au lieu d'un optimum il y a plusieurs optimums avec performance pareille.

source: Instead, the observations in the :file:`pred.txt` file or predictions, may be seen as validation data or dates for which a forecast is desired.
fr_fr: Par contre, les observations dans le fichier :file:`pred.txt` ou prédictions, peuvent être vues comme les données de validation ou les dates pour lesquelles on désire d'avoir une prévision.

source: Is model output robust to reasonable discrepancies in the value of input factors?
fr_fr: Est-ce que le retour du modèle est robuste face à différences raisonnables de la valeur des facteurs d'entrée ?

source: It also facilitates the translation of docstrings and module documentation.
fr_fr: Cette méthode facilite aussi la traduction des docstrings et de la documentation des modules.

source: It also includes identifiability estimation.
fr_fr: Il inclue aussi l'estimation de l'identifiabilité.

source: It can be a path, a string or 'default'.
fr_fr: Peut être un chemin, une chaîne de caractères ou 'default'.

source: It can be seen that forecasts on days with lower temperatures are influenced mostly by :math:`\mu` and forecasts on days with the highest temperatures are influenced mostly by :math:`\alpha`.
fr_fr: On peut voire que les prédictions pour les jours avec de basses température sont influencées principalement par :math:`\mu` et les prédictions pour les jours avec les plus hautes températures sont influencées principalement par :math:`\alpha`.

source: It can be str or float.
fr_fr: Il peut être str ou float.

source: It can be used to modify the parameter range of a parameter to a more convenient one (e.g., if the parameters takes negative values and a log transformation is envisaged).
fr_fr: Ils peuvent être utilisés pour modifier le rang d'un paramètre pour un de plus intéressant (p. ex., si le paramètre prend des valeurs négatives et on veut utiliser une transformation logarithmique).

source: It can take the values 'schur', for Schur's complement analysis for conditional uncertainty propagation; 'err_var', for error variance analysis; or 'prior', prior uncertainty estimation.
fr_fr: Il peut prendre les valeurs 'schur', pour l'analyse du complément de Schur pour la propagation conditionnelle d'incertitudes ; 'err_var', pour l'analyse de la variance de l'erreur ; ou 'prior', pour l'estimation de l'incertitude a priori.

source: It can take the values:
fr_fr: Elle peut prendre les valeurs :

source: It contains a covariance matrix of all the model's parameters.
fr_fr: Il contient une matrice de covariances de tous les paramètres du modèle.

source: It contains standard deviations for individual parameters that have no statistical correlation with other parameters and/or indicates the name of covariance matrix files for other parameters.
fr_fr: Il contient des déviations standard pour des paramètres individuels que ne sont corrélés à d'autres paramètres et/ou indique le nom de la matrice de covariances pour les autres paramètres.

source: It has a higher computational cost than Morris's method.
fr_fr: Elle a un coût computationnel plus élevé que la méthode de Morris.

source: It has a low computational cost and is thus specially apt for models with a high computational time or there is a large number of uncertain parameters.
fr_fr: Elle a un bas coût computationnel et est donc spécialement adaptée aux modèles avec des longs temps de calcul ou quand il y a un grand nombre de paramètres incertaines.

source: It has the same format as `output_file`.
fr_fr: Il a le même format que `output_file`.

source: It is 'glm' for the Gauss-Levenberg-Marquardt algorithm, 'de' for differential evolution.
fr_fr: C'estI 'glm' pour l'algorithme de Gauss-Levenberg-Marquardt, 'de' pour évolution différentielle.

source: It is a file used by PEST++ to write a Jacobian matrix.
fr_fr: C'est un fichier utilisé par PEST++ pour écrire une matrice de Jacobi.

source: It is a global algorithm with longer time of computation than the previous two options.
fr_fr: C'est un algorithme global avec un temps de calcul plus long que les deux options antérieures.

source: It is a gradient algorithm for overdetermined cases.
fr_fr: Est algorithme de descente de gradient pour des cas surdéterminés.

source: It is a one-at-a-time method that analyses sensitivity at different points along the range of parameter values to obtain an average sensitivity measure.
fr_fr: Il s'agit d'une méthode de "variation une à la fois" qu'analyse la sensitivité à différents points le long du rang de valeurs des paramètres pour obtenir un mesure de sensitivité moyenne.

source: It is a technique specially designed to calibrate and quantify the uncertainty of nonlinear models with large numbers of parameters.
fr_fr: C'est une technique spécialement désignée pour calibrer et quantifier l'incertitude des modèles non linéaires avec grands nombres de paramètres.

source: It is also a global algorithm, especially useful for nonlinear models with a large number of parameters, that obtains several sets of parameter values that can be considered to be calibrated.
fr_fr: Il est aussi un algorithme global, spécialement utile pour des modèles non-linéaires avec un grand nombre de paramètres, qui obtient plusieurs jeux de valeurs des paramètres qui peuvent être considérés comme des valeurs calibrées.

source: It is also the month when uncertainty was already highest for the base scenario.
fr_fr: Il est aussi le mois où l'incertitude était plus notable dans le scénario de base.

source: It is also used to group data and to assign names and weights to data.
fr_fr: Il est utilisé aussi pour grouper des données et pour assigner des noms et poids aux données.

source: It is automatically written by the function :func:`write_pest_files` and it is divided in the following sections:
fr_fr: Il est écrit automatiquement par la fonction :func:`write_pest_files` et il contient les sections suivantes :

source: It is calculated during calibration using the function :func:`calibration`.
fr_fr: Les calculs sont réalisés pendant la calibration en utilisant la fonction :func:`calibration`.

source: It is due to the model structure (conceptualisation of the system, equations, objective function, model of the error structure).
fr_fr: Il est dû à la structure du modèle (conceptualisation du système, équations, fonction d'objectifs, modèle de la structure de l'erreur).

source: It is located in the folder :file:`sphinx-doc/glossaries`.
fr_fr: Il est situé dans le dossier :file:`sphinx-doc/glossaries`.

source: It is necessary to provide at least one of these files.
fr_fr: Il faut donner au moins un de ces fichiers.

source: It is possible to analyse data worth with the :class:`Schur` object returned by the function :func:`linear_uncertainty`.
fr_fr: Il est possible d'analyser la valeur des données avec l'objet :class:`Schur` retourné par la fonction :func:`linear_uncertainty`.

source: It is recommended to use the extension .ins.
fr_fr: Il est conseillé d'utiliser l'extension .ins.

source: It is recommended to use the extension .tpl.
fr_fr: Il est conseillé d'utiliser l'extension .tpl.

source: It is supposed that the model has already been calibrated.
fr_fr: On suppose que le modèle a déjà été calibré.

source: It is the case of identifiability measure proposed by Doherty & Hunt (2009) based on the error variance analysis.
fr_fr: C'est le cas de la mesure d'identifiabilité proposé par Doherty & Hunt (2009) basée sur l'analyse de la variance de l'erreur.

source: It is used by the PEST++ executables `pestpp-glm` and (optionally) `pestpp-ies` to limit the change a parameter can suffer at each iteration of the optimization process.
fr_fr: Elle est utilisée par les exécutables de PEST++ `pestpp-glm` et (en option) `pestpp-ies` pour limiter le changement qu'un paramètre peut subir à chaque itération du procès d'optimisation.

source: It is usually equal to 1.
fr_fr: C'est d'habitude égal à 1.

source: It is written by the function by using the data in `obs_file` and `pred_file`.
fr_fr: Il est écrit par la fonction en utilisant les données dans `obs_file` et `pred_file`.

source: It is written by the function using the data it has been passed to it.
fr_fr: Il est écrit par la fonction en utilisant les données que lui ont été passées.

source: It is written by the function using the parameter names in `par_data_file`.
fr_fr: Il est écrit par la fonction en utilisant les noms des paramètres dans `par_data_file`.

source: It is written by the function using the parameter values in `par_data_file`.
fr_fr: Il est écrit par la fonction en utilisant les valeurs des paramètres dans `par_data_file`.

source: It may be applicable to a nonlinear model if the behaviour of the model in the parameter space is approximately linear (:math:`R^2 > 0.7`).
fr_fr: Il peut être appliquée à des modèles non-linéaires si le comportement du modèle dans l'espace des paramètres est approximativement linéaire (:math:`R^2 > 0.7`).

source: It must be at least as long as the observation/prediction name.
fr_fr: Il doit être au moins si long que le nom de l'observation/prédiction.

source: It requires a low computation time, once the model is calibrated.
fr_fr: Il a besoin d'un court temps de calcul une fois le modèle calibré.

source: It requires a much lower number of simulations than Monte Carlo methods.
fr_fr: Il a besoin d'un nombre de simulations beaucoup moindre que les méthodes de Monte Carlo.

source: It should be the best estimate of the parameter value before calibration based on expert knowledge.
fr_fr: Elle devrait être la meilleure estimation de la valeur du paramètre avant de la calibration sur la base de l'avis d'expert.

source: It takes one of four possible values:
fr_fr: Elle prend une de quatre valeurs possibles :

source: It usually requires a large number of simulations (>1000).
fr_fr: D'habitude il a besoin d'un grand nombre de simulations (>1000).

source: Iterative Ensemble Smoother.
fr_fr: Lissage Itératif d'Ensemble.

source: Iterative Ensemble Smoothing
fr_fr: Lissage Itératif d'Ensemble

source: Iterative ensemble smoother, using the function :func:`ies`.
fr_fr: Lissage itératif d'ensemble, en utilisant la fonction :func:`ies`.

source: Launch PEST++ executable.
fr_fr: Lance l'exécutable PEST++.

source: Limited to the linear case, because of the intractability of mathematical solutions in nonlinear cases.
fr_fr: Limitées au cas linéaire, à cause de l'intraitabilité des solutions mathématiques dans les cas non linéaires.

source: Linear regression coefficients can be considered as sensitivity indices in linear models.
fr_fr: Les coefficients de régression linéaire peuvent être considérés comme des indices de sensitivité pour les modèles linéaires.

source: Linear uncertainty analysis
fr_fr: Analyse linéaire d'incertitudes

source: Linear uncertainty analysis, using the function :func:`linear_uncertainty`.
fr_fr: Analyse linéaire d'incertitudes, avec la fonction :func:`linear_uncertainty`.

source: List of initial values of the parameters.
fr_fr: Liste des valeurs initiales des paramètres.

source: List of lower bounds of the parameters.
fr_fr: Liste des seuils inférieurs des paramètres.

source: List of names of the parameters.
fr_fr: Liste de noms des paramètres.

source: List of parameter group names.
fr_fr: Liste de noms des groupes de paramètres.

source: List of upper bounds of the parameters.
fr_fr: Liste des seuils supérieurs des paramètres.

source: List of variable names.
fr_fr: Liste des noms des variables.

source: List or array of time stamps corresponding to the data in the predictions file.
fr_fr: Liste ou array de données de temps correspondantes aux données dans le fichier de prédictions.

source: Local sensitivity analysis.
fr_fr: Analyse de sensitivité locale.

source: Low computation time.
fr_fr: Court temps de calcul.

source: Make sure they are installed before using :mod:`cuspy`.
fr_fr: Assurez-vous qu'ils sont installés avant l'utilisation de :mod:`cuspy`.

source: Make sure you have a clear idea of the model's objective: which are the main variables of interest and for what they will be used.
fr_fr: Il faut s'assurer d'avoir une idée claire de l'objectif du modèle : quelles sont les variables d'intérêt principales et comment elles seront utilisées.

source: Measurement error and natural variability.
fr_fr: Erreur de la mesure et variabilité naturelle.

source: Methods to analyse identifiability
fr_fr: Méthodes pour analyser l'identifiabilité

source: Missing values may be indicated with NA, na or NaN.
fr_fr: Les valeurs manquantes peuvent être indiquées avec NA, na ou NaN.

source: Model calibration (aka parameter estimation, history matching).
fr_fr: Calibration du modèle (ou estimation des paramètres).

source: Model evaluation
fr_fr: Évaluation du modèle

source: Models and simulations
fr_fr: Simulations et modèles

source: Models are useful tools to analyse the behaviour of a system and to increase our understanding of it.
fr_fr: Les modèles sont des instruments utiles pour analyser le comportement d'un système et pour en incrémenter notre compréhension.

source: Models can be considered as approximations of reality based on mathematical relations and inferences based on data.
fr_fr: On peut considérer les modèles comme des approximations de la réalité basées sur des relations mathématiques et sur des inférences dérivées des données.

source: Modified from Beven & Young (2013, Table 3).
fr_fr: Modifié depuis Beven & Young (2013, Table 3).

source: Monte Carlo filtering (also, Hornberger-Spear-Young method or Regional Sensitivity Analysis).
fr_fr: Le filtrage de Monte Carlo (ou aussi méthode de Hornberger-Spear-Young ou Analyse de Sensitivité Régionalisée).

source: Monte Carlo methods.
fr_fr: Méthodes de Monte Carlo.

source: Monte Carlo simulations
fr_fr: Simulations de Monte Carlo

source: Monte Carlo simulations can have several uses, including calibration, global sensitivity analyses and uncertainty analyses, depending on how the simulation results are analysed.
fr_fr: Les simulations de Monte Carlo peuvent être utiles à plusieurs finalités, incluses calibration, analyse de sensitivité global et analyse d'incertitude, en fonction du traitement qu'on fait des résultats de simulations.

source: Monte Carlo simulations, using the function :func:`monte_carlo`.
fr_fr: Simulations de Monte Carlo, avec la fonction :func:`monte_carlo`.

source: Monte Carlo simulations.
fr_fr: Simulations de Monte Carlo.

source: Morris's method (one parameter at a time).
fr_fr: Méthode de Morris (un paramètre à la fois).

source: Morris's method is implemented in this package.
fr_fr: La méthode de Morris est implémentée dans ce paquet.

source: Morris's method.
fr_fr: Méthode de Morris.

source: Multiplier of list of multipliers of the parameter values.
fr_fr: Multiplicateur ou liste de multiplicateurs des valeurs des paramètres.

source: Name of the column containing time data (provided through the argument `time_stamps`.
fr_fr: Nom de la colonne qui contient les données de temps (données par le biais de l'argument `time_stamps`).

source: Natural variability includes different components, such as spatial heterogeneity, environmental variability and genetic variability.
fr_fr: La variabilité naturelle inclue différentes composantes, telles que l'hétérogénéité spatiale, la variabilité environnementale et la variabilité génétique.

source: No
fr_fr: Non

source: No particular type of analysis is implemented in this package, but they can be easily implemented based on the treatment of the input and output csv files (`csv_in` and `sweep_output_csv_file`).
fr_fr: Aucun type particulier d'analyse n'est implémenté dans ce paquet, mais ils peuvent être implémentés facilement par le biais du traitement des fichiers csv d'entrée et de sortie (`csv_in` et `sweep_output_csv_file`).

source: Nomes of the columns in the predictions file.
fr_fr: Noms des colonnes du fichier de prédictions.

source: Nonlinear methods (such as Monte Carlo methods) could also be used to obtain more appropriate quantitative results.
fr_fr: Les méthodes non-linéaires (telles que les méthodes de Monte Carlo) pourrait être utilisées aussi pour avoir des résultats quantitatifs plus appropriés.

source: Nonlinear methods.
fr_fr: Méthodes non linéaires.

source: Nonlinear uncertainty analysis.
fr_fr: Analyse non-linéaire d'incertitudes

source: Number (or list of numbers) of the command line used to calculate the derivatives of the parameters.
fr_fr: Numéro (ou liste de numéros) de la ligne de commande utilisée pour calculer les dérivées des paramètres.

source: Observation group names should correspond to the names of the variables to which the observations belong.
fr_fr: Les noms des groupes d'observations devraient correspondre aux noms des variables auxquelles les observations appartiennent.

source: Observations can be assigned to different groups using the arguments ``obs_groups`` and ``pred_groups``.
fr_fr: Les observations peuvent être assignées à des différents groupes avec les arguments ``obs_groups`` et ``pred_groups``.

source: Of these stages, we are interested here in the last ones.
fr_fr: De ces étapes, nous sommes intéressés ici aux dernières.

source: Offset or list of offsets to aplly to the parameter values.
fr_fr: Écart ou liste d'écarts à appliquer aux valeurs des paramètres.

source: Often there is an assumption of Gaussian probability density functions for better tractability.
fr_fr: Souvent il y a une supposition de fonctions de densité de probabilité normales pour une meilleure traitabilité.

source: On Ubuntu you may use:
fr_fr: Sur Ubuntu vous pouvez utiliser :

source: Once the function is calibrated, you can make a linear uncertainty analysis using the function :func:`linear_uncertainty`.
fr_fr: Une fois la fonction a été calibrée, vous pouvez réaliser un analyse linéaire d'incertitudes avec la fonction :func:`linear_uncertainty`.

source: One way of looking at the data in :file:`obs.txt` is as the data used in the calibration or history matching process.
fr_fr: Une façon d'interpréter les données dans :file:`obs.txt` est de les considérer comme les données utilisées dans le procès de calibration.

source: Only for checks that a model computer code properly reproduces the equations it purports to solve.
fr_fr: Seulement pour tester si le code informatique du modèle reproduis de façon correcte les équations qu'il est censé de résoudre.

source: Only used if ``distribution = mixed``.
fr_fr: Seulement utilisée si ``distribution = mixed``.

source: Optimality is here defined as the minimisation of an objective function, representing some kind of distance between simulated and observed values.
fr_fr: L'optimalité est définie ici comme la minimisation d'une fonction d'objectifs, qui représente quelque sorte de distance entre valeurs simulées et observées.

source: Or is the model highly sensitive to small variations of the value of a parameter (which might indicate overfitting)?
fr_fr: Ou est-ce que le modèle est très sensible à des petites variations de la valeurs d'un paramètre (ce qui pourrait être indicatif de surcalibration) ?

source: Or, if the study is interested in only one aspect, use only one of those sets of data (and only one group) to calibrate the model.
fr_fr: Ou, si l'étude s'intéresse d'un seul aspect, un seul de ces jeux de données (et un seul groupe) pourrait être utilisé pour calibrer le modèle.

source: Other more sophisticated regularisation methods include Tikhonov regularisation and subspace regularisation.
fr_fr: D'autres méthodes de régularisation plus sophistiqués incluent la régularisation de Tikhonov et la régularisation par sous-espaces.

source: PEST++ executable.
fr_fr: Exécutable de PEST++.

source: PEST++ executables for Windows are available at https://github.com/usgs/pestpp/bin/win, but you will need to compile them for Linux (see the instructions below, `Compiling PEST++ executables`_).
fr_fr: Les exécutables de PEST++ pour Windows are sont disponibles sur https://github.com/usgs/pestpp/bin/win, mais pour Linux vous devrez les compiler (voir les instructions dessous, `Compilation des exécutables de PEST++`_).

source: PESTPP-GLM: highly parameterized inversion and global optimization (i.e., parameter optimization, calibration).
fr_fr: PESTPP-GLM: inversion avec un grand nombre de paramètres et optimisation globale (c'est-à-dire, optimisation de paramètres, calibration).

source: PESTPP-IES: interative ensemble smoothing (White 2018).
fr_fr: PESTPP-IES: lissage itératif d'ensemble (White 2018).

source: PESTPP-OPT: constrained optimization under uncertainty (White et al.
fr_fr: PESTPP-OPT: optimisation contrainte sous incertitude (White et al.

source: PESTPP-SEN: global sensitivity analysis.
fr_fr: PESTPP-SEN: analyse de sensitivité globale.

source: PESTPP-SWP: Monte Carlo simulations.
fr_fr: PESTPP-SWP: simulations de Monte Carlo.

source: Parameter identifiability analysis assesses whether it is possible to determine a unique vector of parameter values that optimises model performance or there are multiple parameter values that result in a similar model performance.
fr_fr: L'analyse de l'identifiabilité des paramètres étudie si c'est possible de déterminer un vecteur de valeurs des paramètres unique qui optimise la performance du modèle ou s'il y a multiples valeurs des paramètres qui donnent une performance du modèle comparable.
